In [2]:
 import pandas as pd

In [3]:
df1=pd.DataFrame({'Name':['ayushi','prachi','vaibhav','sushil','archana'],
                 'Marks':[91,85,80,93,78],
                 'gender':['female','female','male','male','female']})

In [4]:
df1

      Name  Marks  gender
0   ayushi     91  female
1   prachi     85  female
2  vaibhav     80    male
3   sushil     93    male
4  archana     78  female

In [5]:
df1.head(3)

      Name  Marks  gender
0   ayushi     91  female
1   prachi     85  female
2  vaibhav     80    male

In [7]:
df1.tail(3)

      Name  Marks  gender
2  vaibhav     80    male
3   sushil     93    male
4  archana     78  female

In [8]:
df1.shape

(5, 3)

In [11]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Marks   5 non-null      int64
 2   gender  5 non-null      object
dtypes: int64(1), object(2)
memory usage: 252.0+ bytes

In [19]:
df1.isnull()

    Name  Marks  gender
0  False  False   False
1  False  False   False
2  False  False   False
3  False  False   False
4  False  False   False

In [23]:
df1.isnull().sum(axis=1)#for rows null values
df1.isnull().sum(axis=0)#for column null values

Name      0
Marks     0
gender    0
dtype: int64

In [27]:
df1.describe(include='all')

          Name      Marks  gender
count        5   5.000000       5
unique       5        NaN       2
top     ayushi        NaN  female
freq         1        NaN       3
mean       NaN  85.400000     NaN
std        NaN   6.580274     NaN
min        NaN  78.000000     NaN
25%        NaN  80.000000     NaN
50%        NaN  85.000000     NaN
75%        NaN  91.000000     NaN
max        NaN  93.000000     NaN

In [32]:
df1.gender.unique()

array(['female', 'male'], dtype=object)

In [31]:
df1.gender.nunique()

2

In [33]:
df1.gender.value_counts()

female    3
male      2
Name: gender, dtype: int64

In [42]:
len(df1[df1['Marks']>=90])

2

In [44]:
df1.Marks.between(90,100).sum()

2

In [53]:
df1.Marks.mean()

85.4

In [57]:
def half_mark(Marks):
    return Marks//2

df1['Half Marks']=df1.Marks.apply(half_mark)

In [58]:
df1

      Name  Marks  gender  Half Marks
0   ayushi     91  female          45
1   prachi     85  female          42
2  vaibhav     80    male          40
3   sushil     93    male          46
4  archana     78  female          39

In [60]:
df1['Mark']=df1.Marks.apply(lambda x:x*2)

In [61]:
df1

      Name  Marks  gender  Half Marks  Mark
0   ayushi     91  female          45   182
1   prachi     85  female          42   170
2  vaibhav     80    male          40   160
3   sushil     93    male          46   186
4  archana     78  female          39   156

In [62]:
df1.Name.apply(len)

0    6
1    6
2    7
3    6
4    7
Name: Name, dtype: int64

In [66]:
df1['male_female']=df1.gender.map({'male':1,"female":0})

In [67]:
df1

      Name  Marks  gender  Half Marks  Mark  male_female
0   ayushi     91  female          45   182            0
1   prachi     85  female          42   170            0
2  vaibhav     80    male          40   160            1
3   sushil     93    male          46   186            1
4  archana     78  female          39   156            0

In [74]:
df1.drop('male_female',axis=1,inplace=True)

In [75]:
df1

      Name  Marks  gender  Half Marks  Mark
0   ayushi     91  female          45   182
1   prachi     85  female          42   170
2  vaibhav     80    male          40   160
3   sushil     93    male          46   186
4  archana     78  female          39   156

In [77]:
df1.columns

Index(['Name', 'Marks', 'gender', 'Half Marks', 'Mark'], dtype='object')

In [79]:
df1.sort_values(by="Marks",ascending=False)

      Name  Marks  gender  Half Marks  Mark
3   sushil     93    male          46   186
0   ayushi     91  female          45   182
1   prachi     85  female          42   170
2  vaibhav     80    male          40   160
4  archana     78  female          39   156

In [86]:
df1[df1['gender']=='female'][['Name','Marks']]

      Name  Marks
0   ayushi     91
1   prachi     85
4  archana     78

In [94]:
df1[df1.gender.isin(['female'])]

      Name  Marks  gender  Half Marks  Mark
0   ayushi     91  female          45   182
1   prachi     85  female          42   170
4  archana     78  female          39   156

In [95]:
df1[df1.gender.isin(['female'])][['Name','Marks']]

      Name  Marks
0   ayushi     91
1   prachi     85
4  archana     78